[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.changemyview", "banned_by": null, "media_embed": {}, "subreddit": "changemyview", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Edit (2/20)&lt;/strong&gt;: I&amp;#39;m putting this at the beginning of my post, because something keeps coming up on comments that is not really related to the point I&amp;#39;m making. Basically, some people seem to think I&amp;#39;m saying that to be good, an episode of TV should\na) have as little narrative relation to other episodes in the series as possible, such that episodes can be watched in any order;\nb) more generally, depend as little as possible on knowledge of the season or series as a whole; and\nc) end with the status quo restored.\nNone of this is what I&amp;#39;m saying. In comments like &lt;a href=\"http://www.reddit.com/r/changemyview/comments/1yf0hw/i_believe_that_being_episodic_generally_makes_a/cfjzcqt\"&gt;this&lt;/a&gt; I use &lt;em&gt;Breaking Bad&lt;/em&gt; as an example of a highly arc-based TV show that still meets all my criteria for being episodic. Please read that comment before making an argument on this subject.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;It&amp;#39;s my impression that, probably since around the time that &lt;em&gt;The Wire&lt;/em&gt; became incredibly critically acclaimed, the idea has been circulating that the greatest dramatic television is &amp;quot;novelistic.&amp;quot; The attitude is usually presented something like this: For most of the history of television drama, stories were contained to single episodes, which resulted in a pretty formulaic structure--for instance, police procedurals where every episode introduces a villain who is caught by the episode&amp;#39;s end, only to resolve the status quo so the whole thing can happen again next episode. But then came ambitious, literary-minded shows like &lt;em&gt;The Wire&lt;/em&gt;, which told long stories over seasons, and didn&amp;#39;t pander to audiences who just wanted to be entertained for an hour.&lt;/p&gt;\n\n&lt;p&gt;Now, I absolutely agree that making use of continuity is a good thing. Earlier episodes should inform our understanding of later episodes. Moreover, I also agree that there&amp;#39;s no need to return to the status quo every episode. That said, I feel like in their attempts to embrace continuity and reject the return to a status quo, at least some TV ends up making incredibly formless and uninteresting episodes. I&amp;#39;ll continue to use &lt;em&gt;The Wire&lt;/em&gt; as my example.&lt;/p&gt;\n\n&lt;p&gt;In any given episode of the &lt;em&gt;The Wire&lt;/em&gt;, we&amp;#39;ll see many stories going on at once. Sometimes two will intersect in some way; sometimes they won&amp;#39;t. Sometimes the themes of one will clearly relate to the themes of another; sometimes they won&amp;#39;t. By the end of the season, of course, most of the stories will have intersected either narratively or thematically, but this isn&amp;#39;t the case on the level of episodes. Furthermore, many of these stories can be described as &lt;em&gt;continuations&lt;/em&gt; of events in past weeks; there is nothing to differentiate them from those events except the fact that they&amp;#39;re happening later. This is to say that much of the episodic construction of &lt;em&gt;The Wire&lt;/em&gt; is pretty arbitrary. There&amp;#39;s rarely much to comment on about a single episode; all we can really talk about is where the story is now.&lt;/p&gt;\n\n&lt;p&gt;The problem for me is that construction is typically what makes a narrative work really interesting. By treating episodes as only pieces in one large story (the season), the show loses the opportunity to makes the episodes themselves interesting as works of art. The best art should make the most of its medium and embrace its constraints and limitations; by not considering the episode as the basic unit of television, &lt;em&gt;The Wire&lt;/em&gt; inevitably loses the opportunity to &lt;em&gt;do&lt;/em&gt; anything with its &amp;quot;TV-ness.&amp;quot; At best this is a missed opportunity. There is nothing really satisfying about rewatching one particular episode of &lt;em&gt;The Wire&lt;/em&gt;, not because it has a bad story, but because it&amp;#39;s only part of a larger story. It&amp;#39;s like opening a novel (even a great novel) at random and reading twenty pages: it will probably be very enjoyable, but only because you&amp;#39;re submerging yourself in a world you enjoy and spending some time there; it&amp;#39;s nothing like the satisfaction gained from reading a great short story, which begins and ends.&lt;/p&gt;\n\n&lt;p&gt;This is not to say that &lt;em&gt;The Wire&lt;/em&gt; was not a good show, nor that it never made good episodes. The problem, though, is that the really good episodes are pretty much just the episodes with big plot developments, typically (though not exclusively) the last two episodes of the season. To fans of &lt;em&gt;The Wire&lt;/em&gt; (or &lt;em&gt;Game of Thrones&lt;/em&gt;, which is structurally very similar to &lt;em&gt;The Wire&lt;/em&gt;), do you ever really feel like re-watching &lt;em&gt;particular&lt;/em&gt; episodes of the show that don&amp;#39;t involve major plot developments? It&amp;#39;s obviously very well made in many respects, so I can fully understand just wanting to watch &lt;em&gt;an&lt;/em&gt; episode, but do you ever want to watch one episode in particular that doesn&amp;#39;t contain a very memorable plot development? (This is different from wanting to watch a particular scene, which I can understand easily.)&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;The Wire&lt;/em&gt; and &lt;em&gt;Game of Thrones&lt;/em&gt; are probably the two biggest offenders in this department, in my opinion, at least among highly acclaimed shows that I&amp;#39;ve seen. (I sometimes hear this description applied to &lt;em&gt;Boardwalk Empire&lt;/em&gt; as well, but I don&amp;#39;t watch that show, so I couldn&amp;#39;t comment. &lt;em&gt;Oz&lt;/em&gt; also seems like it could be an example, but it was never nearly as acclaimed as these other shows, and, in my opinion its structure better resembles traditional soap operas than this mode of &amp;quot;novelistic&amp;quot; TV.) If you could convincingly argue that in fact either &lt;em&gt;The Wire&lt;/em&gt; or &lt;em&gt;Game of Thrones&lt;/em&gt; really &lt;em&gt;does&lt;/em&gt; embrace the episodic format, that would change my view as well.&lt;/p&gt;\n\n&lt;p&gt;(Please note again that I am not saying that arcs are bad and that all episodes should be &amp;quot;standalone.&amp;quot; I think shows like &lt;em&gt;The Sopranos&lt;/em&gt;, &lt;em&gt;Mad Men&lt;/em&gt;, &lt;em&gt;Breaking Bad&lt;/em&gt;, &lt;em&gt;Lost&lt;/em&gt; (at least the earlier seasons, and sporadically for the whole run), and occasionally &lt;em&gt;Buffy the Vampire Slayer&lt;/em&gt; are all examples of great, highly &amp;quot;episodic&amp;quot; TV shows that also regularly had season- and series-long arcs.)&lt;/p&gt;\n\n&lt;p&gt;(Also, if in your response you feel compelled to say that &lt;strong&gt;Baltimore&lt;/strong&gt; was really the main character of &lt;em&gt;The Wire&lt;/em&gt;, man, please first ask yourself if this is really bolstering your argument or if you&amp;#39;re merely repeating a very tired critical cliche because you think it sounds good.)&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Edit&lt;/strong&gt;: I realize that you may want to respond by saying that this is just a matter of taste, or some version of &amp;quot;it&amp;#39;s all subjective.&amp;quot; I guess I would just say that if you don&amp;#39;t believe there&amp;#39;s any real way to judge a work of art&amp;#39;s quality outside arbitrary personal preference, it&amp;#39;s not really in the scope of this discussion to argue that here. It&amp;#39;s sort of like someone saying, e.g., &amp;quot;I believe it&amp;#39;s immoral to send your children to private school,&amp;quot; and someone else responding, &amp;quot;Well, nothing is really right or wrong, because there&amp;#39;s no God, and if God doesn&amp;#39;t exist, then everything is permitted.&amp;quot; It may be the case, but it is by no means self-evident, lots of intelligent people disagree, and it&amp;#39;s almost definitely not going to lead anywhere interesting.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Okay, I&amp;#39;ve awarded a delta. I guess I still hold a weaker version of the claim that I was making in this post, but that&amp;#39;s a change. &lt;/p&gt;\n\n&lt;p&gt;More than half of the top-level responses were mostly responding to the claim that arcs are bad and all episodes should stand totally alone, which was not what I was saying, as I&amp;#39;ve repeatedly pointed out, both in this message and in my responses. If I didn&amp;#39;t respond to you, it may be because I didn&amp;#39;t feel like making that point again.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "**Edit (2/20)**: I'm putting this at the beginning of my post, because something keeps coming up on comments that is not really related to the point I'm making. Basically, some people seem to think I'm saying that to be good, an episode of TV should\na) have as little narrative relation to other episodes in the series as possible, such that episodes can be watched in any order;\nb) more generally, depend as little as possible on knowledge of the season or series as a whole; and\nc) end with the status quo restored.\nNone of this is what I'm saying. In comments like [this](http://www.reddit.com/r/changemyview/comments/1yf0hw/i_believe_that_being_episodic_generally_makes_a/cfjzcqt) I use *Breaking Bad* as an example of a highly arc-based TV show that still meets all my criteria for being episodic. Please read that comment before making an argument on this subject.\n\n---\n\nIt's my impression that, probably since around the time that *The Wire* became incredibly critically acclaimed, the idea has been circulating that the greatest dramatic television is \"novelistic.\" The attitude is usually presented something like this: For most of the history of television drama, stories were contained to single episodes, which resulted in a pretty formulaic structure--for instance, police procedurals where every episode introduces a villain who is caught by the episode's end, only to resolve the status quo so the whole thing can happen again next episode. But then came ambitious, literary-minded shows like *The Wire*, which told long stories over seasons, and didn't pander to audiences who just wanted to be entertained for an hour.\n\nNow, I absolutely agree that making use of continuity is a good thing. Earlier episodes should inform our understanding of later episodes. Moreover, I also agree that there's no need to return to the status quo every episode. That said, I feel like in their attempts to embrace continuity and reject the return to a status quo, at least some TV ends up making incredibly formless and uninteresting episodes. I'll continue to use *The Wire* as my example.\n\nIn any given episode of the *The Wire*, we'll see many stories going on at once. Sometimes two will intersect in some way; sometimes they won't. Sometimes the themes of one will clearly relate to the themes of another; sometimes they won't. By the end of the season, of course, most of the stories will have intersected either narratively or thematically, but this isn't the case on the level of episodes. Furthermore, many of these stories can be described as *continuations* of events in past weeks; there is nothing to differentiate them from those events except the fact that they're happening later. This is to say that much of the episodic construction of *The Wire* is pretty arbitrary. There's rarely much to comment on about a single episode; all we can really talk about is where the story is now.\n\nThe problem for me is that construction is typically what makes a narrative work really interesting. By treating episodes as only pieces in one large story (the season), the show loses the opportunity to makes the episodes themselves interesting as works of art. The best art should make the most of its medium and embrace its constraints and limitations; by not considering the episode as the basic unit of television, *The Wire* inevitably loses the opportunity to *do* anything with its \"TV-ness.\" At best this is a missed opportunity. There is nothing really satisfying about rewatching one particular episode of *The Wire*, not because it has a bad story, but because it's only part of a larger story. It's like opening a novel (even a great novel) at random and reading twenty pages: it will probably be very enjoyable, but only because you're submerging yourself in a world you enjoy and spending some time there; it's nothing like the satisfaction gained from reading a great short story, which begins and ends.\n\nThis is not to say that *The Wire* was not a good show, nor that it never made good episodes. The problem, though, is that the really good episodes are pretty much just the episodes with big plot developments, typically (though not exclusively) the last two episodes of the season. To fans of *The Wire* (or *Game of Thrones*, which is structurally very similar to *The Wire*), do you ever really feel like re-watching *particular* episodes of the show that don't involve major plot developments? It's obviously very well made in many respects, so I can fully understand just wanting to watch *an* episode, but do you ever want to watch one episode in particular that doesn't contain a very memorable plot development? (This is different from wanting to watch a particular scene, which I can understand easily.)\n\n*The Wire* and *Game of Thrones* are probably the two biggest offenders in this department, in my opinion, at least among highly acclaimed shows that I've seen. (I sometimes hear this description applied to *Boardwalk Empire* as well, but I don't watch that show, so I couldn't comment. *Oz* also seems like it could be an example, but it was never nearly as acclaimed as these other shows, and, in my opinion its structure better resembles traditional soap operas than this mode of \"novelistic\" TV.) If you could convincingly argue that in fact either *The Wire* or *Game of Thrones* really *does* embrace the episodic format, that would change my view as well.\n\n(Please note again that I am not saying that arcs are bad and that all episodes should be \"standalone.\" I think shows like *The Sopranos*, *Mad Men*, *Breaking Bad*, *Lost* (at least the earlier seasons, and sporadically for the whole run), and occasionally *Buffy the Vampire Slayer* are all examples of great, highly \"episodic\" TV shows that also regularly had season- and series-long arcs.)\n\n(Also, if in your response you feel compelled to say that **Baltimore** was really the main character of *The Wire*, man, please first ask yourself if this is really bolstering your argument or if you're merely repeating a very tired critical cliche because you think it sounds good.)\n\n**Edit**: I realize that you may want to respond by saying that this is just a matter of taste, or some version of \"it's all subjective.\" I guess I would just say that if you don't believe there's any real way to judge a work of art's quality outside arbitrary personal preference, it's not really in the scope of this discussion to argue that here. It's sort of like someone saying, e.g., \"I believe it's immoral to send your children to private school,\" and someone else responding, \"Well, nothing is really right or wrong, because there's no God, and if God doesn't exist, then everything is permitted.\" It may be the case, but it is by no means self-evident, lots of intelligent people disagree, and it's almost definitely not going to lead anywhere interesting.\n\n---\n\nOkay, I've awarded a delta. I guess I still hold a weaker version of the claim that I was making in this post, but that's a change. \n\nMore than half of the top-level responses were mostly responding to the claim that arcs are bad and all episodes should stand totally alone, which was not what I was saying, as I've repeatedly pointed out, both in this message and in my responses. If I didn't respond to you, it may be because I didn't feel like making that point again.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1yf0hw", "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "sguntun", "media": null, "score": 12, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2w2s8", "edited": 1392949254.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 15, "saved": false, "is_self": true, "permalink": "/r/changemyview/comments/1yf0hw/i_believe_that_being_episodic_generally_makes_a/", "name": "t3_1yf0hw", "created": 1392902562.0, "url": "http://www.reddit.com/r/changemyview/comments/1yf0hw/i_believe_that_being_episodic_generally_makes_a/", "author_flair_text": null, "title": "I believe that being \"episodic\" generally makes a TV series better, and that shows like *The Wire* suffer by ignoring this. CMV.", "created_utc": 1392873762.0, "ups": 27, "num_comments": 29, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "banned_by": null, "subreddit": "changemyview", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "banned_by": null, "subreddit": "changemyview", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "banned_by": null, "subreddit": "changemyview", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "banned_by": null, "subreddit": "changemyview", "likes": null, "replies": "", "saved": false, "id": "cfjymv8", "gilded": 0, "author": "sguntun", "parent_id": "t1_cfjya2c", "approved_by": null, "body": "&gt;Purely episodic shows typically do have less interesting seasons compared to single episodes. Their continual return the the status quo hampers developmental arcs and cause the opposite effect you criticize the Wire for -- there's no reason to ever rewatch a season. Many episodes could be from any part of any season.\n\nI feel like I totally addressed this in the post to which you're responding.\n&gt;Again, I'm not opposing episodic shows to arc-based shows. Probably every non-episodic show will be arc-based, but an episodic show can be arc-based (like *Breaking Bad*) or non-arc-based (like a million police procedurals, or something more ambitious like the first season of *Enlightened*). *Breaking Bad* tells just as much of a unified story as *The Wire*, but each episode (for the most part) is also its own story. This really can't be said of *The Wire*.\n\nThe way I'm using these terms, there is no reason that a show cannot have a season-long arc without being episodic. To call a show episodic is just to say that episodes are formed *as episodes*, not *merely* as pieces of a larger story.\n\nI don't think my argument is circular. You might express it like this:\n1) A good work of art will use its medium to its advantage.\n2) It is part of the medium of TV to be divided into episodes.\nC) Hence, it is good for a TV series to use its division into episodes to its advantage.\nI think this is actually a very weak form of the view, because I would actually say that not only does *The Wire* not use its form to its advantage, it's actually hindered by the fact that it pays little attention to episodes--that stronger form of the view is more difficult to defend, though.\n\nI'm aware that novels have been serialized. I would just comment that some novels lend themselves to serialization while others don't, and that serialization shapes the way that novels are written and presented. *The Wire* is presented in a serialized form, but in a non-serialized style.\n\nYour final point is interesting. I certainly don't believe that films ought to be broken down into episodes; then again, I'll also say that it's not incidental that few films are thirteen hours long. I think I can say that a work that must be consumed in pieces will be better if it's divided into non-arbitrary pieces that have value in and of themselves.", "edited": 1392879579.0, "author_flair_css_class": null, "downs": 5, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Purely episodic shows typically do have less interesting seasons compared to single episodes. Their continual return the the status quo hampers developmental arcs and cause the opposite effect you criticize the Wire for -- there&amp;#39;s no reason to ever rewatch a season. Many episodes could be from any part of any season.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I feel like I totally addressed this in the post to which you&amp;#39;re responding.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Again, I&amp;#39;m not opposing episodic shows to arc-based shows. Probably every non-episodic show will be arc-based, but an episodic show can be arc-based (like &lt;em&gt;Breaking Bad&lt;/em&gt;) or non-arc-based (like a million police procedurals, or something more ambitious like the first season of &lt;em&gt;Enlightened&lt;/em&gt;). &lt;em&gt;Breaking Bad&lt;/em&gt; tells just as much of a unified story as &lt;em&gt;The Wire&lt;/em&gt;, but each episode (for the most part) is also its own story. This really can&amp;#39;t be said of &lt;em&gt;The Wire&lt;/em&gt;.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The way I&amp;#39;m using these terms, there is no reason that a show cannot have a season-long arc without being episodic. To call a show episodic is just to say that episodes are formed &lt;em&gt;as episodes&lt;/em&gt;, not &lt;em&gt;merely&lt;/em&gt; as pieces of a larger story.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think my argument is circular. You might express it like this:\n1) A good work of art will use its medium to its advantage.\n2) It is part of the medium of TV to be divided into episodes.\nC) Hence, it is good for a TV series to use its division into episodes to its advantage.\nI think this is actually a very weak form of the view, because I would actually say that not only does &lt;em&gt;The Wire&lt;/em&gt; not use its form to its advantage, it&amp;#39;s actually hindered by the fact that it pays little attention to episodes--that stronger form of the view is more difficult to defend, though.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m aware that novels have been serialized. I would just comment that some novels lend themselves to serialization while others don&amp;#39;t, and that serialization shapes the way that novels are written and presented. &lt;em&gt;The Wire&lt;/em&gt; is presented in a serialized form, but in a non-serialized style.&lt;/p&gt;\n\n&lt;p&gt;Your final point is interesting. I certainly don&amp;#39;t believe that films ought to be broken down into episodes; then again, I&amp;#39;ll also say that it&amp;#39;s not incidental that few films are thirteen hours long. I think I can say that a work that must be consumed in pieces will be better if it&amp;#39;s divided into non-arbitrary pieces that have value in and of themselves.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yf0hw", "score_hidden": false, "name": "t1_cfjymv8", "created": 1392906990.0, "author_flair_text": null, "created_utc": 1392878190.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cfjya2c", "gilded": 0, "author": "longknives", "parent_id": "t1_cfjxxzn", "approved_by": null, "body": "Purely episodic shows typically *do* have less interesting seasons compared to single episodes. Their continual return the the status quo hampers developmental arcs and cause the opposite effect you criticize the Wire for -- there's no reason to ever rewatch a season. Many episodes could be from any part of any season.\r\rAnother issue is that your argument seems a little circular -- you argue that episodic shows are good because the TV form should be episodic.\r\rI'm not sure what it means for your argument, but it should also be noted that novels have in the past also been serialized, i.e. essentially released as episodes.\r\rThe final point I'd bring up is that if you just look at the Wire and similar shows as very long movies, doesn't that pretty much negate all your criticisms? Or do you think movies ought to be broken up into episodes?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Purely episodic shows typically &lt;em&gt;do&lt;/em&gt; have less interesting seasons compared to single episodes. Their continual return the the status quo hampers developmental arcs and cause the opposite effect you criticize the Wire for -- there&amp;#39;s no reason to ever rewatch a season. Many episodes could be from any part of any season.&lt;/p&gt;\n\n&lt;p&gt;Another issue is that your argument seems a little circular -- you argue that episodic shows are good because the TV form should be episodic.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure what it means for your argument, but it should also be noted that novels have in the past also been serialized, i.e. essentially released as episodes.&lt;/p&gt;\n\n&lt;p&gt;The final point I&amp;#39;d bring up is that if you just look at the Wire and similar shows as very long movies, doesn&amp;#39;t that pretty much negate all your criticisms? Or do you think movies ought to be broken up into episodes?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yf0hw", "score_hidden": false, "name": "t1_cfjya2c", "created": 1392905858.0, "author_flair_text": null, "created_utc": 1392877058.0, "distinguished": null, "num_reports": null, "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "banned_by": null, "subreddit": "changemyview", "likes": null, "replies": "", "saved": false, "id": "cfjybgv", "gilded": 0, "author": "Crayshack", "parent_id": "t1_cfjxxzn", "approved_by": null, "body": "&gt;Well, the comparison I actually used was that it's like reading twenty pages at random, not one chapter. You may feel that's unfair, though.\n\nI do think that comparing it to some random pages rather than a chapter.  I have found that some books barely use chapter breaks as natural breaks in the flow in the story while most shows do a good job at using episode breaks at natural points int eh story.  Overall, I feel that they are used in much the same way at similar frequencies.\n\n&gt;There is a benefit to an episodic structure, because it makes individual episodes more interesting (do you deny this?) without making the season or series as a whole less interesting.\n\nIt does make each individual episode more interesting, but I disagree that it doesn't make the rest of the series less interesting.  Most shows that I have watch that use a primarily episodic structure I get bored with after a few episodes.  Given, I usually watch shows as an archive binge rather than one episode at a time, but what I usually find with episodic shows is a often don't have any motivation to continue watching, while arc based shows will grab my attention and have me scrabbling to play the next episode.\n\n&gt;Again, I'm not opposing episodic shows to arc-based shows. Probably every non-episodic show will be arc-based, but an episodic show can be arc-based (like Breaking Bad) or non-arc-based (like a million police procedurals, or something more ambitious like the first season of Enlightened). Breaking Bad tells just as much of a unified story as The Wire, but each episode (for the most part) is also its own story.\n\nI think I understand your argument better now.  I thought you were advocating purely or at least nearly so episodic shows such as police procedurals.  What it seems you are actually arguing for is a balance between episodic and arc based.  \n\nEven so, I still prefer the non-episodic method of story telling because it makes the story flow more smoothly when watching a whole season at once.  Episodic shows can feel disjointed and jarring when every hour has a new story.  I much prefer the feeling of a show being a \"10 hour movie\", as *Game of Thrones* has been described, rather than a collection of shorter stories.\n\n&gt;Also, The Odyssey is a really strange example to choose here, because it's about as episodic as it gets--hence the division into episodes.\n\nIt's been a while since I read it, and I remember it flowing pretty smoothly between each part.  But, perhaps I am just recalling it poorly.", "edited": false, "author_flair_css_class": " points", "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Well, the comparison I actually used was that it&amp;#39;s like reading twenty pages at random, not one chapter. You may feel that&amp;#39;s unfair, though.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I do think that comparing it to some random pages rather than a chapter.  I have found that some books barely use chapter breaks as natural breaks in the flow in the story while most shows do a good job at using episode breaks at natural points int eh story.  Overall, I feel that they are used in much the same way at similar frequencies.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;There is a benefit to an episodic structure, because it makes individual episodes more interesting (do you deny this?) without making the season or series as a whole less interesting.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It does make each individual episode more interesting, but I disagree that it doesn&amp;#39;t make the rest of the series less interesting.  Most shows that I have watch that use a primarily episodic structure I get bored with after a few episodes.  Given, I usually watch shows as an archive binge rather than one episode at a time, but what I usually find with episodic shows is a often don&amp;#39;t have any motivation to continue watching, while arc based shows will grab my attention and have me scrabbling to play the next episode.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Again, I&amp;#39;m not opposing episodic shows to arc-based shows. Probably every non-episodic show will be arc-based, but an episodic show can be arc-based (like Breaking Bad) or non-arc-based (like a million police procedurals, or something more ambitious like the first season of Enlightened). Breaking Bad tells just as much of a unified story as The Wire, but each episode (for the most part) is also its own story.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think I understand your argument better now.  I thought you were advocating purely or at least nearly so episodic shows such as police procedurals.  What it seems you are actually arguing for is a balance between episodic and arc based.  &lt;/p&gt;\n\n&lt;p&gt;Even so, I still prefer the non-episodic method of story telling because it makes the story flow more smoothly when watching a whole season at once.  Episodic shows can feel disjointed and jarring when every hour has a new story.  I much prefer the feeling of a show being a &amp;quot;10 hour movie&amp;quot;, as &lt;em&gt;Game of Thrones&lt;/em&gt; has been described, rather than a collection of shorter stories.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Also, The Odyssey is a really strange example to choose here, because it&amp;#39;s about as episodic as it gets--hence the division into episodes.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s been a while since I read it, and I remember it flowing pretty smoothly between each part.  But, perhaps I am just recalling it poorly.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yf0hw", "score_hidden": false, "name": "t1_cfjybgv", "created": 1392905980.0, "author_flair_text": "10∆", "created_utc": 1392877180.0, "distinguished": null, "num_reports": null, "ups": 5}}], "after": null, "before": null}}, "saved": false, "id": "cfjxxzn", "gilded": 0, "author": "sguntun", "parent_id": "t1_cfjxc7w", "approved_by": null, "body": "&gt;You make the comparison with a book and that the way a show like The Wire is told makes watching a single episode like reading a single chapter of the book, and that is exactly what it is.\n\nWell, the comparison I actually used was that it's like reading twenty pages at random, not one chapter. You may feel that's unfair, though.\n\nOn to the main point, though, I think I'm getting at your point with this comment:\n&gt;The best art should make the most of its medium and embrace its constraints and limitations; by not considering the episode as the basic unit of television, The Wire inevitably loses the opportunity to do anything with its \"TV-ness.\" At best this is a missed opportunity.\n\nThere is a benefit to an episodic structure, because it makes individual episodes more interesting (do you deny this?) without making the season or series as a whole less interesting. This is something uniquely available to a TV series. I can't see any benefit to a non-episodic structure.\n\n&gt;Think of it as if an episodic show were a collection of short stories like the original Sherlock Holmes stories, while and arc based show is more like *The Odyssey* or *The Hobbit*.\n\nAgain, I'm not opposing episodic shows to arc-based shows. Probably every non-episodic show will be arc-based, but an episodic show can be arc-based (like *Breaking Bad*) or non-arc-based (like a million police procedurals, or something more ambitious like the first season of *Enlightened*).  *Breaking Bad* tells just as much of a unified story as *The Wire*, but each episode (for the most part) is *also* its own story. This really can't be said of *The Wire*. (Also, *The Odyssey* is a really strange example to choose here, because it's about as episodic as it gets--hence the division into episodes.)", "edited": false, "author_flair_css_class": null, "downs": 3, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;You make the comparison with a book and that the way a show like The Wire is told makes watching a single episode like reading a single chapter of the book, and that is exactly what it is.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well, the comparison I actually used was that it&amp;#39;s like reading twenty pages at random, not one chapter. You may feel that&amp;#39;s unfair, though.&lt;/p&gt;\n\n&lt;p&gt;On to the main point, though, I think I&amp;#39;m getting at your point with this comment:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The best art should make the most of its medium and embrace its constraints and limitations; by not considering the episode as the basic unit of television, The Wire inevitably loses the opportunity to do anything with its &amp;quot;TV-ness.&amp;quot; At best this is a missed opportunity.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;There is a benefit to an episodic structure, because it makes individual episodes more interesting (do you deny this?) without making the season or series as a whole less interesting. This is something uniquely available to a TV series. I can&amp;#39;t see any benefit to a non-episodic structure.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Think of it as if an episodic show were a collection of short stories like the original Sherlock Holmes stories, while and arc based show is more like &lt;em&gt;The Odyssey&lt;/em&gt; or &lt;em&gt;The Hobbit&lt;/em&gt;.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Again, I&amp;#39;m not opposing episodic shows to arc-based shows. Probably every non-episodic show will be arc-based, but an episodic show can be arc-based (like &lt;em&gt;Breaking Bad&lt;/em&gt;) or non-arc-based (like a million police procedurals, or something more ambitious like the first season of &lt;em&gt;Enlightened&lt;/em&gt;).  &lt;em&gt;Breaking Bad&lt;/em&gt; tells just as much of a unified story as &lt;em&gt;The Wire&lt;/em&gt;, but each episode (for the most part) is &lt;em&gt;also&lt;/em&gt; its own story. This really can&amp;#39;t be said of &lt;em&gt;The Wire&lt;/em&gt;. (Also, &lt;em&gt;The Odyssey&lt;/em&gt; is a really strange example to choose here, because it&amp;#39;s about as episodic as it gets--hence the division into episodes.)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yf0hw", "score_hidden": false, "name": "t1_cfjxxzn", "created": 1392904854.0, "author_flair_text": null, "created_utc": 1392876054.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cfjxc7w", "gilded": 0, "author": "Crayshack", "parent_id": "t3_1yf0hw", "approved_by": null, "body": "This doesn't mean that a show being episodic makes it better, just that it can be appreciated in a different way.  You make the comparison with a book and that the way a show like *The Wire* is told makes watching a single episode like reading a single chapter of the book, and that is exactly what it is.  But, this argument ignores the fact that novels are often considered highly prized story telling mediums.  Think of it as if an episodic show were a collection of short stories like the original Sherlock Holmes stories, while and arc based show is more like *The Odyssey* or *The Hobbit*.  They are still great forms of literature, but they simply cannot be enjoyed in a short sitting.", "edited": false, "author_flair_css_class": " points", "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This doesn&amp;#39;t mean that a show being episodic makes it better, just that it can be appreciated in a different way.  You make the comparison with a book and that the way a show like &lt;em&gt;The Wire&lt;/em&gt; is told makes watching a single episode like reading a single chapter of the book, and that is exactly what it is.  But, this argument ignores the fact that novels are often considered highly prized story telling mediums.  Think of it as if an episodic show were a collection of short stories like the original Sherlock Holmes stories, while and arc based show is more like &lt;em&gt;The Odyssey&lt;/em&gt; or &lt;em&gt;The Hobbit&lt;/em&gt;.  They are still great forms of literature, but they simply cannot be enjoyed in a short sitting.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yf0hw", "score_hidden": false, "name": "t1_cfjxc7w", "created": 1392903156.0, "author_flair_text": "10∆", "created_utc": 1392874356.0, "distinguished": null, "num_reports": null, "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "banned_by": null, "subreddit": "changemyview", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "banned_by": null, "subreddit": "changemyview", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "banned_by": null, "subreddit": "changemyview", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "banned_by": null, "subreddit": "changemyview", "likes": null, "replies": "", "saved": false, "id": "cfkfk3l", "gilded": 0, "author": "sguntun", "parent_id": "t1_cfk0jkh", "approved_by": null, "body": "Wait, what exactly do you oppose? The idea that for a show like *Breaking Bad*, the episode is the basic unit? The idea that for a show like *The Wire*, the season is the basic unit (you seem to believe this pretty clearly)? Or the idea that the episode *ought* to be the basic unit of a TV series?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wait, what exactly do you oppose? The idea that for a show like &lt;em&gt;Breaking Bad&lt;/em&gt;, the episode is the basic unit? The idea that for a show like &lt;em&gt;The Wire&lt;/em&gt;, the season is the basic unit (you seem to believe this pretty clearly)? Or the idea that the episode &lt;em&gt;ought&lt;/em&gt; to be the basic unit of a TV series?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yf0hw", "score_hidden": false, "name": "t1_cfkfk3l", "created": 1392959021.0, "author_flair_text": null, "created_utc": 1392930221.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cfk0jkh", "gilded": 0, "author": "King_of_the_Nerds", "parent_id": "t1_cfjz376", "approved_by": null, "body": "The \"basic unit of narration\" argument I completely oppose.  The Wire, for instance, is broken up thematically by season, drawing upon seemingly disparate areas of focus and showing how closely they are related. Without the medium of tv this would be impossible to do.  I do long for the days of a great 'space opera' like TNG where everything is wrapped up at the end of the day.  Although, this seemingly cannot be done without skippable, filler episodes (Alexander Rozhenko).  I feel these shows need to fill time and will with a hijinks type episode that furthers nothing but ad revenue. Or worse the dreaded clip show.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The &amp;quot;basic unit of narration&amp;quot; argument I completely oppose.  The Wire, for instance, is broken up thematically by season, drawing upon seemingly disparate areas of focus and showing how closely they are related. Without the medium of tv this would be impossible to do.  I do long for the days of a great &amp;#39;space opera&amp;#39; like TNG where everything is wrapped up at the end of the day.  Although, this seemingly cannot be done without skippable, filler episodes (Alexander Rozhenko).  I feel these shows need to fill time and will with a hijinks type episode that furthers nothing but ad revenue. Or worse the dreaded clip show.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yf0hw", "score_hidden": false, "name": "t1_cfk0jkh", "created": 1392915198.0, "author_flair_text": null, "created_utc": 1392886398.0, "distinguished": null, "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "banned_by": null, "subreddit": "changemyview", "likes": null, "replies": "", "saved": false, "id": "cfjzeb3", "gilded": 0, "author": "the-incredible-ape", "parent_id": "t1_cfjz376", "approved_by": null, "body": "I guess I would counter that individual episodes of Breaking Bad are significantly less interesting out of context, but they do a better job of having a beginning/middle/end of each episode. \n\nThat said, I stick by my point, The Wire takes advantage of having a very long continuous runtime, which is simply not possible outside of the medium of television.  In fact, having more identifiable structure within an episode would harm that benefit that they derive from the TV medium.  I think it's impossible to say that it would or wouldn't be improved if it were rewritten in the way you suggest, though. ", "edited": false, "author_flair_css_class": " points", "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I guess I would counter that individual episodes of Breaking Bad are significantly less interesting out of context, but they do a better job of having a beginning/middle/end of each episode. &lt;/p&gt;\n\n&lt;p&gt;That said, I stick by my point, The Wire takes advantage of having a very long continuous runtime, which is simply not possible outside of the medium of television.  In fact, having more identifiable structure within an episode would harm that benefit that they derive from the TV medium.  I think it&amp;#39;s impossible to say that it would or wouldn&amp;#39;t be improved if it were rewritten in the way you suggest, though. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yf0hw", "score_hidden": false, "name": "t1_cfjzeb3", "created": 1392909769.0, "author_flair_text": "1∆", "created_utc": 1392880969.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cfjz376", "gilded": 0, "author": "sguntun", "parent_id": "t1_cfjyy0y", "approved_by": null, "body": "It's important to note that I'm treating *Breaking Bad* as a show that is structurally *in opposition* to *The Wire* and *Game of Thrones*, because its episodes are constructed as individual stories in their own right, even as they contribute to a larger story. To quote myself quoting myself,\n&gt;&gt;Again, I'm not opposing episodic shows to arc-based shows. Probably every non-episodic show will be arc-based, but an episodic show can be arc-based (like *Breaking Bad*) or non-arc-based (like a million police procedurals, or something more ambitious like the first season of *Enlightened*). *Breaking Bad* tells just as much of a unified story as *The Wire*, but each episode (for the most part) is also its own story. This really can't be said of *The Wire*.\n\n&gt;The way I'm using these terms, there is no reason that a show cannot have a season-long arc without being episodic. To call a show episodic is just to say that episodes are formed *as episodes*, not *merely* as pieces of a larger story.\n\nThis is to say that for *Breaking Bad*, the season is *not* the \"basic unit of narration.\" The episode is. I think shows like *Game of Thrones* or *The Wire* *could* adopt the same approach, and would be better for it. (You may disagree that *Breaking Bad* is actually different from those other shows in this way, but I think it's plainly the case. To speak a little crudely, it's not hard to identify themes and motifs and all that high school English stuff at play on the level of individual episodes of *Breaking Bad*. With a few exceptions, I don't think you can do that for the other two shows, though at least for *The Wire* you can at the level of the season.)", "edited": 1392879992.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s important to note that I&amp;#39;m treating &lt;em&gt;Breaking Bad&lt;/em&gt; as a show that is structurally &lt;em&gt;in opposition&lt;/em&gt; to &lt;em&gt;The Wire&lt;/em&gt; and &lt;em&gt;Game of Thrones&lt;/em&gt;, because its episodes are constructed as individual stories in their own right, even as they contribute to a larger story. To quote myself quoting myself,&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;Again, I&amp;#39;m not opposing episodic shows to arc-based shows. Probably every non-episodic show will be arc-based, but an episodic show can be arc-based (like &lt;em&gt;Breaking Bad&lt;/em&gt;) or non-arc-based (like a million police procedurals, or something more ambitious like the first season of &lt;em&gt;Enlightened&lt;/em&gt;). &lt;em&gt;Breaking Bad&lt;/em&gt; tells just as much of a unified story as &lt;em&gt;The Wire&lt;/em&gt;, but each episode (for the most part) is also its own story. This really can&amp;#39;t be said of &lt;em&gt;The Wire&lt;/em&gt;.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The way I&amp;#39;m using these terms, there is no reason that a show cannot have a season-long arc without being episodic. To call a show episodic is just to say that episodes are formed &lt;em&gt;as episodes&lt;/em&gt;, not &lt;em&gt;merely&lt;/em&gt; as pieces of a larger story.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is to say that for &lt;em&gt;Breaking Bad&lt;/em&gt;, the season is &lt;em&gt;not&lt;/em&gt; the &amp;quot;basic unit of narration.&amp;quot; The episode is. I think shows like &lt;em&gt;Game of Thrones&lt;/em&gt; or &lt;em&gt;The Wire&lt;/em&gt; &lt;em&gt;could&lt;/em&gt; adopt the same approach, and would be better for it. (You may disagree that &lt;em&gt;Breaking Bad&lt;/em&gt; is actually different from those other shows in this way, but I think it&amp;#39;s plainly the case. To speak a little crudely, it&amp;#39;s not hard to identify themes and motifs and all that high school English stuff at play on the level of individual episodes of &lt;em&gt;Breaking Bad&lt;/em&gt;. With a few exceptions, I don&amp;#39;t think you can do that for the other two shows, though at least for &lt;em&gt;The Wire&lt;/em&gt; you can at the level of the season.)&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yf0hw", "score_hidden": false, "name": "t1_cfjz376", "created": 1392908572.0, "author_flair_text": null, "created_utc": 1392879772.0, "distinguished": null, "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "saved": false, "id": "cfjyy0y", "gilded": 0, "author": "the-incredible-ape", "parent_id": "t3_1yf0hw", "approved_by": null, "body": "Hmm, this is an interesting idea, and to me this is the core of your argument, or at least the most compelling part: \n\n&gt;The Wire inevitably loses the opportunity to do anything with its \"TV-ness.\"\n\nBut, I disagree.  The Wire (or breaking bad, etc.) are stories that could never be presented quite as well except in that \"season-as-basic-unit-of-narration\" format.  A movie series?  No, movies need unitary narrative arcs even more than TV episodes.  A book?  Well, OK, but it's not really comparable. \n\nI don't disagree that having episode-scale narrative arcs is often desirable.  But, I don't think that Breaking Bad, The Wire, or GOT suffer for lack of it.  In fact, they work exceptionally well with this format, which is ONLY possible on TV.  They benefit immensely from the ability to stretch a narrative arc over 10-20 continuous hours of video, which is a facility that is unique to TV. \n\nSo, in fact, I think they are making excellent and full use of their TV-ness, just a different aspect of the format. ", "edited": false, "author_flair_css_class": " points", "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hmm, this is an interesting idea, and to me this is the core of your argument, or at least the most compelling part: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The Wire inevitably loses the opportunity to do anything with its &amp;quot;TV-ness.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;But, I disagree.  The Wire (or breaking bad, etc.) are stories that could never be presented quite as well except in that &amp;quot;season-as-basic-unit-of-narration&amp;quot; format.  A movie series?  No, movies need unitary narrative arcs even more than TV episodes.  A book?  Well, OK, but it&amp;#39;s not really comparable. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t disagree that having episode-scale narrative arcs is often desirable.  But, I don&amp;#39;t think that Breaking Bad, The Wire, or GOT suffer for lack of it.  In fact, they work exceptionally well with this format, which is ONLY possible on TV.  They benefit immensely from the ability to stretch a narrative arc over 10-20 continuous hours of video, which is a facility that is unique to TV. &lt;/p&gt;\n\n&lt;p&gt;So, in fact, I think they are making excellent and full use of their TV-ness, just a different aspect of the format. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yf0hw", "score_hidden": false, "name": "t1_cfjyy0y", "created": 1392908046.0, "author_flair_text": "1∆", "created_utc": 1392879246.0, "distinguished": null, "num_reports": null, "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "banned_by": null, "subreddit": "changemyview", "likes": null, "replies": "", "saved": false, "id": "cfjz3yv", "gilded": 0, "author": "untitledthegreat", "parent_id": "t3_1yf0hw", "approved_by": null, "body": "*Breaking Bad* isn't really an episodic show. It's very serialized, and you can't really view episodes out of order without it being confusing. Why do you consider that episodic, but *The Wire* more serialized. Also, I haven't seen *The Wire*, so could you please keep your explanation spoiler free.", "edited": false, "author_flair_css_class": "points ", "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;Breaking Bad&lt;/em&gt; isn&amp;#39;t really an episodic show. It&amp;#39;s very serialized, and you can&amp;#39;t really view episodes out of order without it being confusing. Why do you consider that episodic, but &lt;em&gt;The Wire&lt;/em&gt; more serialized. Also, I haven&amp;#39;t seen &lt;em&gt;The Wire&lt;/em&gt;, so could you please keep your explanation spoiler free.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yf0hw", "score_hidden": false, "name": "t1_cfjz3yv", "created": 1392908649.0, "author_flair_text": "1∆", "created_utc": 1392879849.0, "distinguished": null, "num_reports": null, "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "banned_by": null, "subreddit": "changemyview", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "banned_by": null, "subreddit": "changemyview", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "banned_by": null, "subreddit": "changemyview", "likes": null, "replies": "", "saved": false, "id": "cfko2uj", "gilded": 0, "author": "DeltaBot", "parent_id": "t1_cfko2g9", "approved_by": null, "body": "Confirmed: 1 delta awarded to /u/DaftMythic. ^[[History](/r/changemyview/wiki/user/DaftMythic)]\n\n^[[Wiki](http://www.reddit.com/r/changemyview/wiki/deltabot)][[Code](https://github.com/alexames/DeltaBot)][[Subreddit](http://www.reddit.com/r/DeltaBot/)]", "edited": false, "author_flair_css_class": "points", "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Confirmed: 1 delta awarded to &lt;a href=\"/u/DaftMythic\"&gt;/u/DaftMythic&lt;/a&gt;. &lt;sup&gt;[&lt;a href=\"/r/changemyview/wiki/user/DaftMythic\"&gt;History&lt;/a&gt;]&lt;/sup&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;[&lt;a href=\"http://www.reddit.com/r/changemyview/wiki/deltabot\"&gt;Wiki&lt;/a&gt;][&lt;a href=\"https://github.com/alexames/DeltaBot\"&gt;Code&lt;/a&gt;][&lt;a href=\"http://www.reddit.com/r/DeltaBot/\"&gt;Subreddit&lt;/a&gt;]&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yf0hw", "score_hidden": true, "name": "t1_cfko2uj", "created": 1392977445.0, "author_flair_text": "∞∆", "created_utc": 1392948645.0, "distinguished": "moderator", "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "banned_by": null, "subreddit": "changemyview", "likes": null, "replies": "", "saved": false, "id": "cfkv3nz", "gilded": 0, "author": "DaftMythic", "parent_id": "t1_cfko2g9", "approved_by": null, "body": "Yay, first Delta!\n\nI was writing in bits and pieces on my smart phone so it was not as unified as I liked but glad it got the point across.\n\nI think there is a sort of natural \"rhythm\" of each medium though that you could identify and maybe even calculate in some way to get to some deeper narrative criticism. For instance it would be insane for anyone to read 4000 pages of text just to get to a few good paragraphs (even for something like philosophy, let alone a story).\n\nSimilarly a TV series that plods on for 20 seasons with 30 episodes each to get to some (Even if amazingly climactic) conclusion is insane.\n\nHuman perception and attention spans just are what they are, at some limiting point are exhausted. But before that limit there is lots of room to work with.\n\nThat said, Brevity is the soul of wit and the journey should be just as engaging, if not more so, than the destination. So short and regularly rewarding probably IS better in some way, and some structures/mediums may be better at that.", "edited": false, "author_flair_css_class": " points", "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yay, first Delta!&lt;/p&gt;\n\n&lt;p&gt;I was writing in bits and pieces on my smart phone so it was not as unified as I liked but glad it got the point across.&lt;/p&gt;\n\n&lt;p&gt;I think there is a sort of natural &amp;quot;rhythm&amp;quot; of each medium though that you could identify and maybe even calculate in some way to get to some deeper narrative criticism. For instance it would be insane for anyone to read 4000 pages of text just to get to a few good paragraphs (even for something like philosophy, let alone a story).&lt;/p&gt;\n\n&lt;p&gt;Similarly a TV series that plods on for 20 seasons with 30 episodes each to get to some (Even if amazingly climactic) conclusion is insane.&lt;/p&gt;\n\n&lt;p&gt;Human perception and attention spans just are what they are, at some limiting point are exhausted. But before that limit there is lots of room to work with.&lt;/p&gt;\n\n&lt;p&gt;That said, Brevity is the soul of wit and the journey should be just as engaging, if not more so, than the destination. So short and regularly rewarding probably IS better in some way, and some structures/mediums may be better at that.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yf0hw", "score_hidden": true, "name": "t1_cfkv3nz", "created": 1392996256.0, "author_flair_text": "1∆", "created_utc": 1392967456.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cfko2g9", "gilded": 0, "author": "sguntun", "parent_id": "t1_cfk3gzm", "approved_by": null, "body": "&amp;#8710;\nThis is a really interesting point, and though I didn't agree with all of what you're saying, I'm coming around to the notion that what we want to call characteristic of any medium has much less to do with its \"essence\" and much more to do with the stylistic use made of it. For instance, I think you're right that there's no reason *in principle* that an episode of television *must* be the basic unit of a series; and we can imagine a universe in which the page divisions of a book *are* clearly constructed in a way similar to a TV show's episodes. I don't think it's arbitrary that the episode is typically used as a \"conceptual unit\" while a page is typically used as a \"delivery unit\" (to use your terms); the fact that a week separates episodes' airing (and that even when binge-watching we must go through the motions of setting a new episode up) makes it seem \"natural\" that an episode should be one unit. But as you say, if this non-episodic mode of television became the norm, we probably would no longer have that expectation. I maintain that one structure may still just in itself be better than the other, but it is not a question of more structure vs. less, or paying attention to structure vs. ignoring it.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;#8710;\nThis is a really interesting point, and though I didn&amp;#39;t agree with all of what you&amp;#39;re saying, I&amp;#39;m coming around to the notion that what we want to call characteristic of any medium has much less to do with its &amp;quot;essence&amp;quot; and much more to do with the stylistic use made of it. For instance, I think you&amp;#39;re right that there&amp;#39;s no reason &lt;em&gt;in principle&lt;/em&gt; that an episode of television &lt;em&gt;must&lt;/em&gt; be the basic unit of a series; and we can imagine a universe in which the page divisions of a book &lt;em&gt;are&lt;/em&gt; clearly constructed in a way similar to a TV show&amp;#39;s episodes. I don&amp;#39;t think it&amp;#39;s arbitrary that the episode is typically used as a &amp;quot;conceptual unit&amp;quot; while a page is typically used as a &amp;quot;delivery unit&amp;quot; (to use your terms); the fact that a week separates episodes&amp;#39; airing (and that even when binge-watching we must go through the motions of setting a new episode up) makes it seem &amp;quot;natural&amp;quot; that an episode should be one unit. But as you say, if this non-episodic mode of television became the norm, we probably would no longer have that expectation. I maintain that one structure may still just in itself be better than the other, but it is not a question of more structure vs. less, or paying attention to structure vs. ignoring it.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yf0hw", "score_hidden": true, "name": "t1_cfko2g9", "created": 1392977421.0, "author_flair_text": null, "created_utc": 1392948621.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cfk3gzm", "gilded": 0, "author": "DaftMythic", "parent_id": "t3_1yf0hw", "approved_by": null, "body": "I think you are making a conflation between a conceptual unit and a delivery unit.\n\nTaken to your logical conclusion you might argue that each page in any textual literature must take advantage of the page nature of the medium. So each page of the great gatsby must contain a completeness that embraces its pageness just like each episode of The Wire MUST have a completeness that embraces its episode-ness.\n\nSometimes though it takes a few pages to build up to those epic lines, dialog and scenes that we all remember In the book. Not every page can be a work of literary genius compact into itself, nor should it be. We don't go to a random page (after having read the novel) to read something that captures some essence of the book on EVERY page. We go to pages 203-205 where our favorite dialog between the protagonist and the love interest occurs.\n\nSometimes the leg work to get to those epic 3 pages with layers of depth and meaning takes 30 pages from when the protagonist first encounters the obstacle preventing him from being with the love interest and we get a sub plot involving the backstory.\n\nBut each of those 30 pages had to encapsulate something individually... What stress to be a writer. Just because I write poetry doesn't mean each poem has to be a hiku of the exact words I have to fit on a page. Pages are just a delivery method set in a series to deliver a story.\n\nSo the work should be judged by the conceptual units chosen by the author not the delivery units they are limited to. Sure maybe it would be cool if where each page is perfectly sized to the story being told on it: page one is letter sized, page two is post card sized, page three is an a2, page four is a fold out the size of a large map. But that is an unreasonable burden on the artist. He does not want to tell a story dictated by the size of paper her can get a printer to print on.\n\nYou seem to reject the idea of a tv show that is really just a long movie (13 hour seasons or 55 hours long go a series lets say) but why? The episode length in this case is just an artifact of delivery consistency, like the choice of size of paper. It's not intrinsically relevant to the work if the artist does not want it to be and the consultant delivery does not unduly burden most viewers.\n\nA perfect example is movie reels. Movies used to come in reels of physical film and many early films had a certain formula based on which reel you were in. The love scene on reel 3 the chase on reel 5 always finish by reel 8. That's fine but following or breaking that formula does not make a film better or worse. There are Hindi movies that still follow that sort of formulaic style, between reel 3-4, 6-7 9-10  there is always obligatory dance scenes even if it breaks the flow of the story the first half of the movie before intermission has a sort of completeness to it, and the last half is sort of complete to itself too, with an obligatory dance scene.\n\nBut reels are outdated now, the technology has moved on and continuous films of whatever length the author wants are accepted. Now that there is digital there is no physical \"reel\" and the pacing of the movie has more to do with what the viewers can handle in length and other style concerns.\n\nI think that what you are viewing with \"The Wire\" is the same maturation of the mediums. With the web I am sure you will get serial \"shows\" with drastically different  episode lengths that each stand on their own much better. From an episodes measured in scores of second to episodes hours long for the same series.\n\nBut for now even the \"Not TV\" that is HBO must fit the delivery mechanism into formats that are roughly consistent. This goes much more for ad driven formats.\n\nBut personally is rather the artist tell the story they want to tell as best they can given delivery constraints. That means some stories are episodic and some are something else. ", "edited": false, "author_flair_css_class": " points", "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you are making a conflation between a conceptual unit and a delivery unit.&lt;/p&gt;\n\n&lt;p&gt;Taken to your logical conclusion you might argue that each page in any textual literature must take advantage of the page nature of the medium. So each page of the great gatsby must contain a completeness that embraces its pageness just like each episode of The Wire MUST have a completeness that embraces its episode-ness.&lt;/p&gt;\n\n&lt;p&gt;Sometimes though it takes a few pages to build up to those epic lines, dialog and scenes that we all remember In the book. Not every page can be a work of literary genius compact into itself, nor should it be. We don&amp;#39;t go to a random page (after having read the novel) to read something that captures some essence of the book on EVERY page. We go to pages 203-205 where our favorite dialog between the protagonist and the love interest occurs.&lt;/p&gt;\n\n&lt;p&gt;Sometimes the leg work to get to those epic 3 pages with layers of depth and meaning takes 30 pages from when the protagonist first encounters the obstacle preventing him from being with the love interest and we get a sub plot involving the backstory.&lt;/p&gt;\n\n&lt;p&gt;But each of those 30 pages had to encapsulate something individually... What stress to be a writer. Just because I write poetry doesn&amp;#39;t mean each poem has to be a hiku of the exact words I have to fit on a page. Pages are just a delivery method set in a series to deliver a story.&lt;/p&gt;\n\n&lt;p&gt;So the work should be judged by the conceptual units chosen by the author not the delivery units they are limited to. Sure maybe it would be cool if where each page is perfectly sized to the story being told on it: page one is letter sized, page two is post card sized, page three is an a2, page four is a fold out the size of a large map. But that is an unreasonable burden on the artist. He does not want to tell a story dictated by the size of paper her can get a printer to print on.&lt;/p&gt;\n\n&lt;p&gt;You seem to reject the idea of a tv show that is really just a long movie (13 hour seasons or 55 hours long go a series lets say) but why? The episode length in this case is just an artifact of delivery consistency, like the choice of size of paper. It&amp;#39;s not intrinsically relevant to the work if the artist does not want it to be and the consultant delivery does not unduly burden most viewers.&lt;/p&gt;\n\n&lt;p&gt;A perfect example is movie reels. Movies used to come in reels of physical film and many early films had a certain formula based on which reel you were in. The love scene on reel 3 the chase on reel 5 always finish by reel 8. That&amp;#39;s fine but following or breaking that formula does not make a film better or worse. There are Hindi movies that still follow that sort of formulaic style, between reel 3-4, 6-7 9-10  there is always obligatory dance scenes even if it breaks the flow of the story the first half of the movie before intermission has a sort of completeness to it, and the last half is sort of complete to itself too, with an obligatory dance scene.&lt;/p&gt;\n\n&lt;p&gt;But reels are outdated now, the technology has moved on and continuous films of whatever length the author wants are accepted. Now that there is digital there is no physical &amp;quot;reel&amp;quot; and the pacing of the movie has more to do with what the viewers can handle in length and other style concerns.&lt;/p&gt;\n\n&lt;p&gt;I think that what you are viewing with &amp;quot;The Wire&amp;quot; is the same maturation of the mediums. With the web I am sure you will get serial &amp;quot;shows&amp;quot; with drastically different  episode lengths that each stand on their own much better. From an episodes measured in scores of second to episodes hours long for the same series.&lt;/p&gt;\n\n&lt;p&gt;But for now even the &amp;quot;Not TV&amp;quot; that is HBO must fit the delivery mechanism into formats that are roughly consistent. This goes much more for ad driven formats.&lt;/p&gt;\n\n&lt;p&gt;But personally is rather the artist tell the story they want to tell as best they can given delivery constraints. That means some stories are episodic and some are something else. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yf0hw", "score_hidden": false, "name": "t1_cfk3gzm", "created": 1392931997.0, "author_flair_text": "1∆", "created_utc": 1392903197.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "banned_by": null, "subreddit": "changemyview", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "banned_by": null, "subreddit": "changemyview", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "banned_by": null, "subreddit": "changemyview", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "banned_by": null, "subreddit": "changemyview", "likes": null, "replies": "", "saved": false, "id": "cfkwtf2", "gilded": 0, "author": "sguntun", "parent_id": "t1_cfkvf5e", "approved_by": null, "body": "I don't see the force of that argument. You could say exactly the same thing about a 13 hour test pattern.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t see the force of that argument. You could say exactly the same thing about a 13 hour test pattern.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yf0hw", "score_hidden": true, "name": "t1_cfkwtf2", "created": 1393005161.0, "author_flair_text": null, "created_utc": 1392976361.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cfkvf5e", "gilded": 0, "author": "I-HATE-REDDITORS", "parent_id": "t1_cfko5nw", "approved_by": null, "body": "If the show couldn't have been made in another medium, and it couldn't have been better in a medium, how can you argue that it wasn't taking advantage of the unique strengths of TV?", "edited": false, "author_flair_css_class": "points ", "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If the show couldn&amp;#39;t have been made in another medium, and it couldn&amp;#39;t have been better in a medium, how can you argue that it wasn&amp;#39;t taking advantage of the unique strengths of TV?&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yf0hw", "score_hidden": true, "name": "t1_cfkvf5e", "created": 1392997622.0, "author_flair_text": "8∆", "created_utc": 1392968822.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cfko5nw", "gilded": 0, "author": "sguntun", "parent_id": "t1_cfk47u3", "approved_by": null, "body": "&gt;In what medium but TV could *The Wire* tell a continuous 13-hour story? Or a continuous 60-hour story?\n\nMy point is not that *The Wire* could easily have been made in another medium, let alone that it would have been better in another medium; my point is that by \"leaning in\" to the medium of TV more, *The Wire* could have been better, without losing anything that makes its season-length arcs great.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;In what medium but TV could &lt;em&gt;The Wire&lt;/em&gt; tell a continuous 13-hour story? Or a continuous 60-hour story?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;My point is not that &lt;em&gt;The Wire&lt;/em&gt; could easily have been made in another medium, let alone that it would have been better in another medium; my point is that by &amp;quot;leaning in&amp;quot; to the medium of TV more, &lt;em&gt;The Wire&lt;/em&gt; could have been better, without losing anything that makes its season-length arcs great.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yf0hw", "score_hidden": true, "name": "t1_cfko5nw", "created": 1392977627.0, "author_flair_text": null, "created_utc": 1392948827.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cfk47u3", "gilded": 0, "author": "I-HATE-REDDITORS", "parent_id": "t3_1yf0hw", "approved_by": null, "body": "&gt; The best art should make the most of its medium and embrace its constraints and limitations; by not considering the episode as the basic unit of television, The Wire inevitably loses the opportunity to do anything with its \"TV-ness.\" At best this is a missed opportunity.\n\nIn what medium but TV could *The Wire* tell a continuous 13-hour story?  Or a continuous 60-hour story?\n\nI also wish we had more episodic series just for their own sake, but the way people watch TV now really lends itself to the serial format.   *The Wire* may not be a good example because it pre-dates the most recent changes in our media landscape and viewing habits.  But  \"binge-watching,\" or at least watching on your own schedule-- via On Demand, Netflix, Hulu, DVD, and DVR-- is the way TV is consumed now.  There's no reason why shows should follow the same storytelling rules as they did in the 1950s.", "edited": false, "author_flair_css_class": "points ", "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The best art should make the most of its medium and embrace its constraints and limitations; by not considering the episode as the basic unit of television, The Wire inevitably loses the opportunity to do anything with its &amp;quot;TV-ness.&amp;quot; At best this is a missed opportunity.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;In what medium but TV could &lt;em&gt;The Wire&lt;/em&gt; tell a continuous 13-hour story?  Or a continuous 60-hour story?&lt;/p&gt;\n\n&lt;p&gt;I also wish we had more episodic series just for their own sake, but the way people watch TV now really lends itself to the serial format.   &lt;em&gt;The Wire&lt;/em&gt; may not be a good example because it pre-dates the most recent changes in our media landscape and viewing habits.  But  &amp;quot;binge-watching,&amp;quot; or at least watching on your own schedule-- via On Demand, Netflix, Hulu, DVD, and DVR-- is the way TV is consumed now.  There&amp;#39;s no reason why shows should follow the same storytelling rules as they did in the 1950s.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yf0hw", "score_hidden": false, "name": "t1_cfk47u3", "created": 1392934549.0, "author_flair_text": "8∆", "created_utc": 1392905749.0, "distinguished": null, "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "banned_by": null, "subreddit": "changemyview", "likes": null, "replies": "", "saved": false, "id": "cfk07ek", "gilded": 0, "author": "creistre", "parent_id": "t3_1yf0hw", "approved_by": null, "body": "I haven't seen the wire, so I'll pick on game of thrones. Keep in mind game of thrones actually are novels, so this structure is very appropriate for them. \n\nMy thought on this is around how I watch a tv show. I very rarely watch a single episode at a time these days. Much more often I either watch 3 or 4 episodes at a time, or if I'm binging then a whole season in a weekend. When you consume the media like that the episode arc sucks balls. It's just dead boring to watch the same formula over and over and over. It's at the point where highly episodic shows (white collar, gray's anatomy, other shows my wife watches) I just can't sit through; I need to be fiddling on my phone or on my laptop or something else to relieve the dead boredom of watch the episode formula again. \n\nThe more of a central story arc running through every episode, tying the episodes together into a wider season arc the better I find the show. All of those shows you mentioned above hit that nail on the head, breaking bad and true blood are especially good at running episodes together with a single storyline. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I haven&amp;#39;t seen the wire, so I&amp;#39;ll pick on game of thrones. Keep in mind game of thrones actually are novels, so this structure is very appropriate for them. &lt;/p&gt;\n\n&lt;p&gt;My thought on this is around how I watch a tv show. I very rarely watch a single episode at a time these days. Much more often I either watch 3 or 4 episodes at a time, or if I&amp;#39;m binging then a whole season in a weekend. When you consume the media like that the episode arc sucks balls. It&amp;#39;s just dead boring to watch the same formula over and over and over. It&amp;#39;s at the point where highly episodic shows (white collar, gray&amp;#39;s anatomy, other shows my wife watches) I just can&amp;#39;t sit through; I need to be fiddling on my phone or on my laptop or something else to relieve the dead boredom of watch the episode formula again. &lt;/p&gt;\n\n&lt;p&gt;The more of a central story arc running through every episode, tying the episodes together into a wider season arc the better I find the show. All of those shows you mentioned above hit that nail on the head, breaking bad and true blood are especially good at running episodes together with a single storyline. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yf0hw", "score_hidden": false, "name": "t1_cfk07ek", "created": 1392913410.0, "author_flair_text": null, "created_utc": 1392884610.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "banned_by": null, "subreddit": "changemyview", "likes": null, "replies": "", "saved": false, "id": "cfk3bgr", "gilded": 0, "author": "Gumbee", "parent_id": "t3_1yf0hw", "approved_by": null, "body": "Honestly, some stories just need to be told a certain way.  If we accept that the conceit or purpose of any television show is to tell a story, is it not then too much of a stretch to accept that some require that story to be told over a long, drawn out period of time?  I honestly don't think a show like The Wire, or Game of Thrones, or more recently True Detective would work if the story was structured episodically.  Most Dramas don't.\n\nThe same way a show like Community would be absolutely terrible if it followed a more novelistic narrative structure, something like The Wire just wouldnt work if each episode wasn't about progressing towards the resolution of that season's, or even the entire series' overarching plot.  \n\nThis is more of an aside, but yes I do often find myself returning to re-watch the more tentpole episodes of some of my favroutie novelistic series.  Stuff like the 8th or 9th episodes of basically any Game of Thrones season, the bigger, more showy episodes of Breaking Bad or The Wire, theyre not self-contained, and would make absolutely no sense without knowledge of prior episodes, but the experience and thrill of rewatching them is no different than re-watching a favourite episode of The Office or Parks and Rec.", "edited": false, "author_flair_css_class": " points", "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly, some stories just need to be told a certain way.  If we accept that the conceit or purpose of any television show is to tell a story, is it not then too much of a stretch to accept that some require that story to be told over a long, drawn out period of time?  I honestly don&amp;#39;t think a show like The Wire, or Game of Thrones, or more recently True Detective would work if the story was structured episodically.  Most Dramas don&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;The same way a show like Community would be absolutely terrible if it followed a more novelistic narrative structure, something like The Wire just wouldnt work if each episode wasn&amp;#39;t about progressing towards the resolution of that season&amp;#39;s, or even the entire series&amp;#39; overarching plot.  &lt;/p&gt;\n\n&lt;p&gt;This is more of an aside, but yes I do often find myself returning to re-watch the more tentpole episodes of some of my favroutie novelistic series.  Stuff like the 8th or 9th episodes of basically any Game of Thrones season, the bigger, more showy episodes of Breaking Bad or The Wire, theyre not self-contained, and would make absolutely no sense without knowledge of prior episodes, but the experience and thrill of rewatching them is no different than re-watching a favourite episode of The Office or Parks and Rec.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yf0hw", "score_hidden": false, "name": "t1_cfk3bgr", "created": 1392931402.0, "author_flair_text": "1∆", "created_utc": 1392902602.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "banned_by": null, "subreddit": "changemyview", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "banned_by": null, "subreddit": "changemyview", "likes": null, "replies": "", "saved": false, "id": "cfkgcrb", "gilded": 0, "author": "sguntun", "parent_id": "t1_cfk4b79", "approved_by": null, "body": "&gt; Why did they kill Mr Burns?\n\nThat didn't happen.\n\nI think I address everything in this comment in the edit that now precedes the body of my post.\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Why did they kill Mr Burns?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That didn&amp;#39;t happen.&lt;/p&gt;\n\n&lt;p&gt;I think I address everything in this comment in the edit that now precedes the body of my post.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yf0hw", "score_hidden": false, "name": "t1_cfkgcrb", "created": 1392960589.0, "author_flair_text": null, "created_utc": 1392931789.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "saved": false, "id": "cfk4b79", "gilded": 0, "author": "toiracse", "parent_id": "t3_1yf0hw", "approved_by": null, "body": "My counter-argument is that the large reasons why people watch episodic television is because they want to see plot/character/story development.\n\nCase in point - Unresolved Sexual Tension. Writers of episodic dramas will spend years and years trying to maintain unresolved sexual tension between their characters instead of simply letting the characters evolve. People don't watch *for* the UST, they watch because they really want it to be broken. However once it *is* broken, writers lose tools for their characters, and the show jumps the shark. The whole will they/won't they - if the show keeps going, you're never going to know.\n\nWhat I'm saying is if you're watching a classical show, expecting anything to move forward, expecting anything to really matter in the episode, then you're going to have a bad time. Shows don't want to move the plot forward because that means they're closer to ending, which they don't want.\n\nThis is what makes you lose interest in a series, and television may be shown in episodes, but they are *ordered in series*. The network orders 24/12/whatever episodes at a time. The point of watching most shows is that you come back next week to see what happens next.\n\nSo the heavily episodic television is really working against itself in terms of creating meaningful characters, and exploring the lives of those characters because the assumption is that the status quo is set, and won't change.\n\nNo one will die. No one will get married. Nothing really meaningful will happen - but the audience really wants it to happen. If you go back to the episodic television you really love, the episodes you would rewatch are the ones where the story moves forward, the one where the status quo changes, the one where something really important happens to your characters.\n\nThe opposite to this is something like The Simpsons. No continuity, no arcs, just really good writing. But it's hard for writers to produce gem after gem after gem and stay relevant. Series' drag on even if you really like the humor or the characters. Why did they kill Mr Burns? Why did Family Guy kill Brian? Why did they bring them back? Because they needed to garner some interest, get people watching again, and then needed to set back the status quo. Being restricted like that is not good for television. It's not good writing either. Series will run themselves into the ground time after time trying to keep the status quo, and trying to avoid jumping the shark - and that is boring.\n\nSo my argument is that the things that make episodic television GOOD are often the expectance of things people long for from story arcs/progression and to avoid arcs is to stagnate, killing your show.", "edited": false, "author_flair_css_class": " points", "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My counter-argument is that the large reasons why people watch episodic television is because they want to see plot/character/story development.&lt;/p&gt;\n\n&lt;p&gt;Case in point - Unresolved Sexual Tension. Writers of episodic dramas will spend years and years trying to maintain unresolved sexual tension between their characters instead of simply letting the characters evolve. People don&amp;#39;t watch &lt;em&gt;for&lt;/em&gt; the UST, they watch because they really want it to be broken. However once it &lt;em&gt;is&lt;/em&gt; broken, writers lose tools for their characters, and the show jumps the shark. The whole will they/won&amp;#39;t they - if the show keeps going, you&amp;#39;re never going to know.&lt;/p&gt;\n\n&lt;p&gt;What I&amp;#39;m saying is if you&amp;#39;re watching a classical show, expecting anything to move forward, expecting anything to really matter in the episode, then you&amp;#39;re going to have a bad time. Shows don&amp;#39;t want to move the plot forward because that means they&amp;#39;re closer to ending, which they don&amp;#39;t want.&lt;/p&gt;\n\n&lt;p&gt;This is what makes you lose interest in a series, and television may be shown in episodes, but they are &lt;em&gt;ordered in series&lt;/em&gt;. The network orders 24/12/whatever episodes at a time. The point of watching most shows is that you come back next week to see what happens next.&lt;/p&gt;\n\n&lt;p&gt;So the heavily episodic television is really working against itself in terms of creating meaningful characters, and exploring the lives of those characters because the assumption is that the status quo is set, and won&amp;#39;t change.&lt;/p&gt;\n\n&lt;p&gt;No one will die. No one will get married. Nothing really meaningful will happen - but the audience really wants it to happen. If you go back to the episodic television you really love, the episodes you would rewatch are the ones where the story moves forward, the one where the status quo changes, the one where something really important happens to your characters.&lt;/p&gt;\n\n&lt;p&gt;The opposite to this is something like The Simpsons. No continuity, no arcs, just really good writing. But it&amp;#39;s hard for writers to produce gem after gem after gem and stay relevant. Series&amp;#39; drag on even if you really like the humor or the characters. Why did they kill Mr Burns? Why did Family Guy kill Brian? Why did they bring them back? Because they needed to garner some interest, get people watching again, and then needed to set back the status quo. Being restricted like that is not good for television. It&amp;#39;s not good writing either. Series will run themselves into the ground time after time trying to keep the status quo, and trying to avoid jumping the shark - and that is boring.&lt;/p&gt;\n\n&lt;p&gt;So my argument is that the things that make episodic television GOOD are often the expectance of things people long for from story arcs/progression and to avoid arcs is to stagnate, killing your show.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yf0hw", "score_hidden": false, "name": "t1_cfk4b79", "created": 1392934830.0, "author_flair_text": "1∆", "created_utc": 1392906030.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "banned_by": null, "subreddit": "changemyview", "likes": null, "replies": "", "saved": false, "id": "cfk5lhe", "gilded": 0, "author": "Destac", "parent_id": "t3_1yf0hw", "approved_by": null, "body": "From what I can tell, what means the most to you in this is this:\n\nEpisodic stories are able to be watched at any point without knowing a backstory\n\nTherefore the backstory becomes not the past story lines, but instead the story at the back of the main story.\n\nThe reason I cannot agree with either of these stems from watching shows like NCIS, or LAW AND ORDER.\n\nThese shows are decent, but episodic shows are too hindered. If you turn on the tv at any point you can say \"I bet this guy did it\" at the end you are either right or wrong. In honesty, the shows themselves cater to the lowest common denominator, they are meant to be watched by people who don't pay as close attention.\n\nShows like the wire are not. They are stories, they are focused on these back stories coming to fruiting, not on outside sources acting on people.\n\nIn the wire, every person is where they are for a reason, and we find that out, the characters are expressed and explained and we learn about through whatever action they take. An action that is not hampered by whatever monster of the week (to steal Whedon's line) has come along to befuddle them.\n\nWhedon, Buffy especially, worked around this. There are entire seasons which work much like the wire (I think season 3 it was, with the mayor) where it becomes not at all serialised. And every storyline is part of what the mayor is doing. Those are my favourite seasons.\n\nBut the first season of Buffy is dreadful, it was a lowest common denominator show.\n\nNow yes, I aggressively dislike structured shows. They are... Lack luster because the ones that are good are so far outnumbered, not because people can't write them or because they are too limited, but because of whom they are written for.\n\nIf you're saying we should only reference the best of the best, then tell me what you believe should be mentioned, I personally like the wire but did not love it, and my favourite tv show (the west wing) could be considered structuralised. Either way, I'd like to discuss this further.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;From what I can tell, what means the most to you in this is this:&lt;/p&gt;\n\n&lt;p&gt;Episodic stories are able to be watched at any point without knowing a backstory&lt;/p&gt;\n\n&lt;p&gt;Therefore the backstory becomes not the past story lines, but instead the story at the back of the main story.&lt;/p&gt;\n\n&lt;p&gt;The reason I cannot agree with either of these stems from watching shows like NCIS, or LAW AND ORDER.&lt;/p&gt;\n\n&lt;p&gt;These shows are decent, but episodic shows are too hindered. If you turn on the tv at any point you can say &amp;quot;I bet this guy did it&amp;quot; at the end you are either right or wrong. In honesty, the shows themselves cater to the lowest common denominator, they are meant to be watched by people who don&amp;#39;t pay as close attention.&lt;/p&gt;\n\n&lt;p&gt;Shows like the wire are not. They are stories, they are focused on these back stories coming to fruiting, not on outside sources acting on people.&lt;/p&gt;\n\n&lt;p&gt;In the wire, every person is where they are for a reason, and we find that out, the characters are expressed and explained and we learn about through whatever action they take. An action that is not hampered by whatever monster of the week (to steal Whedon&amp;#39;s line) has come along to befuddle them.&lt;/p&gt;\n\n&lt;p&gt;Whedon, Buffy especially, worked around this. There are entire seasons which work much like the wire (I think season 3 it was, with the mayor) where it becomes not at all serialised. And every storyline is part of what the mayor is doing. Those are my favourite seasons.&lt;/p&gt;\n\n&lt;p&gt;But the first season of Buffy is dreadful, it was a lowest common denominator show.&lt;/p&gt;\n\n&lt;p&gt;Now yes, I aggressively dislike structured shows. They are... Lack luster because the ones that are good are so far outnumbered, not because people can&amp;#39;t write them or because they are too limited, but because of whom they are written for.&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re saying we should only reference the best of the best, then tell me what you believe should be mentioned, I personally like the wire but did not love it, and my favourite tv show (the west wing) could be considered structuralised. Either way, I&amp;#39;d like to discuss this further.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yf0hw", "score_hidden": false, "name": "t1_cfk5lhe", "created": 1392938363.0, "author_flair_text": null, "created_utc": 1392909563.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "banned_by": null, "subreddit": "changemyview", "likes": null, "replies": "", "saved": false, "id": "cfk84so", "gilded": 0, "author": "fadingthought", "parent_id": "t3_1yf0hw", "approved_by": null, "body": "What is your criteria for this? I would easily put Breaking Bad on the same side of the spectrum as The Wire, which would be very far from Buffy. \n\nI would argue that television is a great medium for shows like The Wire. I remember episodes of The X-Files vividly, it was a great episodic show. I rewatch them and enjoy them. But The Wire? That show rattled me to my core. The anticipation for each episode was unlike any show I had ever watched before. If I missed the monster of the week for the X-Files or Buffy, it wasn't that big of a deal. But I wanted to see every second of the Wire.  ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What is your criteria for this? I would easily put Breaking Bad on the same side of the spectrum as The Wire, which would be very far from Buffy. &lt;/p&gt;\n\n&lt;p&gt;I would argue that television is a great medium for shows like The Wire. I remember episodes of The X-Files vividly, it was a great episodic show. I rewatch them and enjoy them. But The Wire? That show rattled me to my core. The anticipation for each episode was unlike any show I had ever watched before. If I missed the monster of the week for the X-Files or Buffy, it wasn&amp;#39;t that big of a deal. But I wanted to see every second of the Wire.  &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yf0hw", "score_hidden": false, "name": "t1_cfk84so", "created": 1392944167.0, "author_flair_text": null, "created_utc": 1392915367.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "banned_by": null, "subreddit": "changemyview", "likes": null, "replies": "", "saved": false, "id": "cfkb2ak", "gilded": 0, "author": "learhpa", "parent_id": "t3_1yf0hw", "approved_by": null, "body": "&gt; I guess I would just say that if you don't believe there's any real way to judge a work of art's quality outside arbitrary personal preference, it's not really in the scope of this discussion to argue that here\n\nI don't think that's implied by the \"it's a matter of taste\" argument.\n\nI think the underpinning of \"it's a matter of taste\" - which was the argument I was tempted to make - is that episodic dramas and dramas-as-novels are *different things* which should be judged by different standards. I can say that a red delicious apple is a terrible apple without agreeing that oranges are bad and apples are better.\n\n&gt; In any given episode of the The Wire, we'll see many stories going on at once. Sometimes two will intersect in some way; sometimes they won't. Sometimes the themes of one will clearly relate to the themes of another; sometimes they won't. By the end of the season, of course, most of the stories will have intersected either narratively or thematically, but this isn't the case on the level of episodes. Furthermore, many of these stories can be described as continuations of events in past weeks; there is nothing to differentiate them from those events except the fact that they're happening later. \n\nThis is something that I *like* about the Wire, and other shows with similar properties (House of Cards, 24, Oz, Babylon 5, Rome, etc): there are a bunch of different plotlines running in parallel that together cause the characters to grow and change over the course of the series, and the episodes are basically just arbitrary chapter boundaries on the lives of the characters.\n\nThat *form* is a very different form from standard episodic drama. Standard episodic drama depends on reliability, depends on things *not* changing, on people being able to jump in at any point and understand what's going on because it's fundamentally no different from where it was when they last jumped in. \n\nYour short-story vs. novel comparison is *great*, I think it's spot on. I like novels and find short stories unfulfilling, so I find long-term story-as-novel to be much more interesting and fulfilling than episodic drama. \n\nBut fundamentally they're not the same thing, and it's unfair to judge a novel for being a bad short story collection - it's not *trying* to be a short story collection.", "edited": false, "author_flair_css_class": " points", "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I guess I would just say that if you don&amp;#39;t believe there&amp;#39;s any real way to judge a work of art&amp;#39;s quality outside arbitrary personal preference, it&amp;#39;s not really in the scope of this discussion to argue that here&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t think that&amp;#39;s implied by the &amp;quot;it&amp;#39;s a matter of taste&amp;quot; argument.&lt;/p&gt;\n\n&lt;p&gt;I think the underpinning of &amp;quot;it&amp;#39;s a matter of taste&amp;quot; - which was the argument I was tempted to make - is that episodic dramas and dramas-as-novels are &lt;em&gt;different things&lt;/em&gt; which should be judged by different standards. I can say that a red delicious apple is a terrible apple without agreeing that oranges are bad and apples are better.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;In any given episode of the The Wire, we&amp;#39;ll see many stories going on at once. Sometimes two will intersect in some way; sometimes they won&amp;#39;t. Sometimes the themes of one will clearly relate to the themes of another; sometimes they won&amp;#39;t. By the end of the season, of course, most of the stories will have intersected either narratively or thematically, but this isn&amp;#39;t the case on the level of episodes. Furthermore, many of these stories can be described as continuations of events in past weeks; there is nothing to differentiate them from those events except the fact that they&amp;#39;re happening later. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is something that I &lt;em&gt;like&lt;/em&gt; about the Wire, and other shows with similar properties (House of Cards, 24, Oz, Babylon 5, Rome, etc): there are a bunch of different plotlines running in parallel that together cause the characters to grow and change over the course of the series, and the episodes are basically just arbitrary chapter boundaries on the lives of the characters.&lt;/p&gt;\n\n&lt;p&gt;That &lt;em&gt;form&lt;/em&gt; is a very different form from standard episodic drama. Standard episodic drama depends on reliability, depends on things &lt;em&gt;not&lt;/em&gt; changing, on people being able to jump in at any point and understand what&amp;#39;s going on because it&amp;#39;s fundamentally no different from where it was when they last jumped in. &lt;/p&gt;\n\n&lt;p&gt;Your short-story vs. novel comparison is &lt;em&gt;great&lt;/em&gt;, I think it&amp;#39;s spot on. I like novels and find short stories unfulfilling, so I find long-term story-as-novel to be much more interesting and fulfilling than episodic drama. &lt;/p&gt;\n\n&lt;p&gt;But fundamentally they&amp;#39;re not the same thing, and it&amp;#39;s unfair to judge a novel for being a bad short story collection - it&amp;#39;s not &lt;em&gt;trying&lt;/em&gt; to be a short story collection.&lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yf0hw", "score_hidden": false, "name": "t1_cfkb2ak", "created": 1392950181.0, "author_flair_text": "9∆", "created_utc": 1392921381.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "banned_by": null, "subreddit": "changemyview", "likes": null, "replies": "", "saved": false, "id": "cfkimmk", "gilded": 0, "author": "lost_my_pw_again", "parent_id": "t3_1yf0hw", "approved_by": null, "body": "When you say good TV you have to make a distinction between TV with ads and TV without ads.\n\nFor TV shows with advertisement each advertisement block is a critical point cause you do not want the viewer to switch the channel or at least want him to switch back once the advertisement is over. Thus the episode has to be designed to deliver that (and they are, sorry for anyone who hasn't noticed before, it's kind of a glass shattering moment).\n\nHBO and Showtime episodes do not have that restraint. You have 60 minutes of TV without those arbitrary breaks in between. \n\nIs that an advantage or a disadvantage?\n\nAnother point is that HBO and Showtime series aren't that rating driven. So they are allowed to have more freedom. They can be episodic if the artist wants that, or they can be serialized if the artist does like that better. They sell you art. A very interesting article in that regard:\n\nhttp://tvbythenumbers.zap2it.com/2014/02/05/broadcast-tv-viewers-youre-not-the-customer-youre-the-product-being-sold-2/234774/\n\n&gt; The laments from commenters that broadcast television networks \"need to listen to their customers\" typically betray a fundamental misunderstanding of the relationship between broadcast TV viewers and broadcast TV networks.\n\n&gt; Viewers are not the broadcast networks' customers, they're the networks' product.\n\n&gt; How do the customers and products stack up in TV land?\n\n&gt; Broadcast TV Networks:\n\n&gt; Customers: Traditionally advertisers. In recent years, broadcast networks have begun negotiating carriage fees from cable, satellite and telephone providers, so those companies are now also customers.  \nProduct: Viewers (adults 18-49 in primetime) to advertisers. Programming feed to providers.\n\n&gt; Ad Supported Cable Networks:\n\n&gt; Customers: Same customers as the broadcast TV networks, but currently reversed in importance. Carriage fees are more important to most (all?) ad supported cable networks than is advertising revenue.  \n&gt; Product: Viewers (various age/gender demo groups) to advertisers. Programming feed to providers.\n\n&gt; Premium Cable Networks: (HBO, Showtime, etc)\n\n&gt; Customers: Primarily subscribers, but carriage providers as well, who act as the \"retailers\" of their product.  \n&gt; Product: Programming.\n\n&gt; TV Studios:\n\n&gt; Customers: Broadcast and cable networks, both for first run and syndication. DVD buyers. Online streaming companies (Netflix, Hulu, Amazon, etc).  \n&gt; Product: TV programs.\n\n\nSo they do not have to ensure that you are coming back after each episode on a very specific day at a very specific time. They have to ensure that you aren't going to cancel the subscription and for that it is way more important that the whole season is great than that each episode is. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When you say good TV you have to make a distinction between TV with ads and TV without ads.&lt;/p&gt;\n\n&lt;p&gt;For TV shows with advertisement each advertisement block is a critical point cause you do not want the viewer to switch the channel or at least want him to switch back once the advertisement is over. Thus the episode has to be designed to deliver that (and they are, sorry for anyone who hasn&amp;#39;t noticed before, it&amp;#39;s kind of a glass shattering moment).&lt;/p&gt;\n\n&lt;p&gt;HBO and Showtime episodes do not have that restraint. You have 60 minutes of TV without those arbitrary breaks in between. &lt;/p&gt;\n\n&lt;p&gt;Is that an advantage or a disadvantage?&lt;/p&gt;\n\n&lt;p&gt;Another point is that HBO and Showtime series aren&amp;#39;t that rating driven. So they are allowed to have more freedom. They can be episodic if the artist wants that, or they can be serialized if the artist does like that better. They sell you art. A very interesting article in that regard:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://tvbythenumbers.zap2it.com/2014/02/05/broadcast-tv-viewers-youre-not-the-customer-youre-the-product-being-sold-2/234774/\"&gt;http://tvbythenumbers.zap2it.com/2014/02/05/broadcast-tv-viewers-youre-not-the-customer-youre-the-product-being-sold-2/234774/&lt;/a&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The laments from commenters that broadcast television networks &amp;quot;need to listen to their customers&amp;quot; typically betray a fundamental misunderstanding of the relationship between broadcast TV viewers and broadcast TV networks.&lt;/p&gt;\n\n&lt;p&gt;Viewers are not the broadcast networks&amp;#39; customers, they&amp;#39;re the networks&amp;#39; product.&lt;/p&gt;\n\n&lt;p&gt;How do the customers and products stack up in TV land?&lt;/p&gt;\n\n&lt;p&gt;Broadcast TV Networks:&lt;/p&gt;\n\n&lt;p&gt;Customers: Traditionally advertisers. In recent years, broadcast networks have begun negotiating carriage fees from cable, satellite and telephone providers, so those companies are now also customers.&lt;br/&gt;\nProduct: Viewers (adults 18-49 in primetime) to advertisers. Programming feed to providers.&lt;/p&gt;\n\n&lt;p&gt;Ad Supported Cable Networks:&lt;/p&gt;\n\n&lt;p&gt;Customers: Same customers as the broadcast TV networks, but currently reversed in importance. Carriage fees are more important to most (all?) ad supported cable networks than is advertising revenue.&lt;br/&gt;\nProduct: Viewers (various age/gender demo groups) to advertisers. Programming feed to providers.&lt;/p&gt;\n\n&lt;p&gt;Premium Cable Networks: (HBO, Showtime, etc)&lt;/p&gt;\n\n&lt;p&gt;Customers: Primarily subscribers, but carriage providers as well, who act as the &amp;quot;retailers&amp;quot; of their product.&lt;br/&gt;\nProduct: Programming.&lt;/p&gt;\n\n&lt;p&gt;TV Studios:&lt;/p&gt;\n\n&lt;p&gt;Customers: Broadcast and cable networks, both for first run and syndication. DVD buyers. Online streaming companies (Netflix, Hulu, Amazon, etc).&lt;br/&gt;\nProduct: TV programs.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;So they do not have to ensure that you are coming back after each episode on a very specific day at a very specific time. They have to ensure that you aren&amp;#39;t going to cancel the subscription and for that it is way more important that the whole season is great than that each episode is. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yf0hw", "score_hidden": false, "name": "t1_cfkimmk", "created": 1392965125.0, "author_flair_text": null, "created_utc": 1392936325.0, "distinguished": null, "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "banned_by": null, "subreddit": "changemyview", "likes": null, "replies": "", "saved": false, "id": "cfk3g6w", "gilded": 0, "author": "DaftMythic", "parent_id": "t3_1yf0hw", "approved_by": null, "body": "I think you are making a conflation between a conceptual unit and a delivery unit.\n\nTaken to your logical conclusion you might argue that each page in any textual literature must take advantage of the page nature of the medium. So each page of the great gatsby must contain a completeness that embraces its pageness just like each episode of The Wire MUST have a completeness that embraces its episode-ness.\n\nSometimes though it takes a few pages to build up to those epic lines, dialog and scenes that we all remember In the book. Not every page can be a work of literary genius compact into itself, nor should it be. We don't go to a random page (after having read the novel) to read something that captures some essence of the book on EVERY page. We go to pages 203-205 where our favorite dialog between the protagonist and the love interest occurs.\n\nSometimes the leg work to get to those epic 3 pages with layers of depth and meaning takes 30 pages from when the protagonist first encounters the obstacle preventing him from being with the love interest and we get a sub plot involving the backstory.\n\nBut each of those 30 pages had to encapsulate something individually... What stress to be a writer. Just because I write poetry doesn't mean each poem has to be a hiku of the exact words I have to fit on a page. Pages are just a delivery method set in a series to deliver a story.\n\nSo the work should be judged by the conceptual units chosen by the author not the delivery units they are limited to. Sure maybe it would be cool if where each page is perfectly sized to the story being told on it: page one is letter sized, page two is post card sized, page three is an a2, page four is a fold out the size of a large map. But that is an unreasonable burden on the artist. He does not want to tell a story dictated by the size of paper her can get a printer to print on.\n\nYou seem to reject the idea of a tv show that is really just a long movie (13 hour seasons or 55 hours long go a series lets say) but why? The episode length in this case is just an artifact of delivery consistency, like the choice of size of paper. It's not intrinsically relevant to the work if the artist does not want it to be and the consultant delivery does not unduly burden most viewers.\n\nA perfect example is movie reels. Movies used to come in reels of physical film and many early films had a certain formula based on which reel you were in. The love scene on reel 3 the chase on reel 5 always finish by reel 8. That's fine but following or breaking that formula does not make a film better or worse. There are Hindi movies that still follow that sort of formulaic style, between reel 3-4, 6-7 9-10  there is always obligatory dance scenes even if it breaks the flow of the story the first half of the movie before intermission has a sort of completeness to it, and the last half is sort of complete to itself too, with an obligatory dance scene.\n\nBut reels are outdated now, the technology has moved on and continuous films of whatever length the author wants are accepted. Now that there is digital there is no physical \"reel\" and the pacing of the movie has more to do with what the viewers can handle in length and other style concerns.\n\nI think that what you are viewing with \"The Wire\" is the same maturation of the mediums. With the web I am sure you will get serial \"shows\" with drastically different  episode lengths that each stand on their own much better. From an episodes measured in scores of second to episodes hours long for the same series.\n\nBut for now even the \"Not TV\" that is HBO must fit the delivery mechanism into formats that are roughly consistent. This goes much more for ad driven formats.\n\nBut personally is rather the artist tell the story they want to tell as best they can given delivery constraints. That means some stories are episodic and some are something else. ", "edited": false, "author_flair_css_class": " points", "downs": 1, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you are making a conflation between a conceptual unit and a delivery unit.&lt;/p&gt;\n\n&lt;p&gt;Taken to your logical conclusion you might argue that each page in any textual literature must take advantage of the page nature of the medium. So each page of the great gatsby must contain a completeness that embraces its pageness just like each episode of The Wire MUST have a completeness that embraces its episode-ness.&lt;/p&gt;\n\n&lt;p&gt;Sometimes though it takes a few pages to build up to those epic lines, dialog and scenes that we all remember In the book. Not every page can be a work of literary genius compact into itself, nor should it be. We don&amp;#39;t go to a random page (after having read the novel) to read something that captures some essence of the book on EVERY page. We go to pages 203-205 where our favorite dialog between the protagonist and the love interest occurs.&lt;/p&gt;\n\n&lt;p&gt;Sometimes the leg work to get to those epic 3 pages with layers of depth and meaning takes 30 pages from when the protagonist first encounters the obstacle preventing him from being with the love interest and we get a sub plot involving the backstory.&lt;/p&gt;\n\n&lt;p&gt;But each of those 30 pages had to encapsulate something individually... What stress to be a writer. Just because I write poetry doesn&amp;#39;t mean each poem has to be a hiku of the exact words I have to fit on a page. Pages are just a delivery method set in a series to deliver a story.&lt;/p&gt;\n\n&lt;p&gt;So the work should be judged by the conceptual units chosen by the author not the delivery units they are limited to. Sure maybe it would be cool if where each page is perfectly sized to the story being told on it: page one is letter sized, page two is post card sized, page three is an a2, page four is a fold out the size of a large map. But that is an unreasonable burden on the artist. He does not want to tell a story dictated by the size of paper her can get a printer to print on.&lt;/p&gt;\n\n&lt;p&gt;You seem to reject the idea of a tv show that is really just a long movie (13 hour seasons or 55 hours long go a series lets say) but why? The episode length in this case is just an artifact of delivery consistency, like the choice of size of paper. It&amp;#39;s not intrinsically relevant to the work if the artist does not want it to be and the consultant delivery does not unduly burden most viewers.&lt;/p&gt;\n\n&lt;p&gt;A perfect example is movie reels. Movies used to come in reels of physical film and many early films had a certain formula based on which reel you were in. The love scene on reel 3 the chase on reel 5 always finish by reel 8. That&amp;#39;s fine but following or breaking that formula does not make a film better or worse. There are Hindi movies that still follow that sort of formulaic style, between reel 3-4, 6-7 9-10  there is always obligatory dance scenes even if it breaks the flow of the story the first half of the movie before intermission has a sort of completeness to it, and the last half is sort of complete to itself too, with an obligatory dance scene.&lt;/p&gt;\n\n&lt;p&gt;But reels are outdated now, the technology has moved on and continuous films of whatever length the author wants are accepted. Now that there is digital there is no physical &amp;quot;reel&amp;quot; and the pacing of the movie has more to do with what the viewers can handle in length and other style concerns.&lt;/p&gt;\n\n&lt;p&gt;I think that what you are viewing with &amp;quot;The Wire&amp;quot; is the same maturation of the mediums. With the web I am sure you will get serial &amp;quot;shows&amp;quot; with drastically different  episode lengths that each stand on their own much better. From an episodes measured in scores of second to episodes hours long for the same series.&lt;/p&gt;\n\n&lt;p&gt;But for now even the &amp;quot;Not TV&amp;quot; that is HBO must fit the delivery mechanism into formats that are roughly consistent. This goes much more for ad driven formats.&lt;/p&gt;\n\n&lt;p&gt;But personally is rather the artist tell the story they want to tell as best they can given delivery constraints. That means some stories are episodic and some are something else. &lt;/p&gt;\n&lt;/div&gt;", "link_id": "t3_1yf0hw", "score_hidden": false, "name": "t1_cfk3g6w", "created": 1392931912.0, "author_flair_text": "1∆", "created_utc": 1392903112.0, "distinguished": null, "num_reports": null, "ups": 1}}], "after": null, "before": null}}]